# DVD Rental Data Model

Lets load the necessary packages to SQL in this notebook.  I will be using the ipython sql extension and also pandas.  

to use and the ipython sql extesion we need to install the ipython-sql extensin using pip install ipython-sql extesion.  To be able to use  pandas we also need to install the pandas package using the pip install pandas

In [5]:
%load_ext sql
import pandas as pd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
DB_ENDPOINT = "127.0.0.1"
DB = 'dvdrental'
DB_USER = 'manny'
DB_PASSWORD = 'Yankees1'
DB_PORT = '5433'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://manny:Yankees1@127.0.0.1:5433/dvdrental

In [8]:
%sql $conn_string

### Record counts for each table in the database 

For each table in th edata were going to do a quick record count to determine the size of each table.

In [11]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

* postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
 * postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 14596
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

### Exploring the payment table

Lets explore the payment table as it contains date information of payments we are considering this table to have fact data.  Fact is data that can be measure by the dimensions.   We can also use the data in the payment table as a dimension to allow the user to to time analysis on the data.   

Notice from the below query we have data in th payment tables between 2/24/2007 and 5/14/2007.

In [12]:
%%sql 

select min(payment_date) as MinDate
    , max(payment_date) as MaxDate
from payment

* postgresql://manny:***@127.0.0.1:5433/dvdrental
1 rows affected.

[(datetime.datetime(2007, 2, 14, 21, 21, 59, 996577), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

### Exploring where the transaction are coming from 

The below query we will be exploring where are, from a geographical perspective, the transactions are comming from.  We have the address table and in the address table 
we have a field district the district it translate to a region in the United States it will be a states, in some countries is a province.   

The below query shows the top 10 districts in the address table.

In [14]:
%%sql 

select district, count(*)
from address 
group by 1
order by count(*) desc 
limit 10

* postgresql://manny:***@127.0.0.1:5433/dvdrental
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

### Top Grossing Films. 

We want to see the top grossing films on the database.  We have the payment table and we also have the film table.   From the data model there is no direct link between payments and film.  The payment tables links to the rental table and the rental table links to inventory which inventory links to the film table.

In [16]:
%%sql 

select f.title, p.amount, p.payment_date, p.customer_id
from payment p 
join rental r on (p.rental_id = r.rental_id)
join inventory i on (r.inventory_id = i.inventory_id)
join film f on (i.film_id = f.film_id)
limit 5;

* postgresql://manny:***@127.0.0.1:5433/dvdrental
5 rows affected.

[('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 4, 8, 17, 31, 41, 996577), 431),
 ('Academy Dinosaur', Decimal('3.99'), datetime.datetime(2007, 3, 2, 18, 41, 36, 996577), 518),
 ('Academy Dinosaur', Decimal('3.99'), datetime.datetime(2007, 3, 21, 19, 56, 9, 996577), 279),
 ('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 2, 17, 18, 52, 26, 996577), 170),
 ('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 4, 7, 9, 9, 57, 996577), 161)]

We already joined the table using the qury below and the result yield the movie title the price, the date and the customer.  In order to select the top 10 grossing movies we will utilize the the same query to summing up the amount and grouping by title.

In [17]:
%%sql 

select f.title, sum(p.amount) as revenue 
from payment p 
join rental r on (p.rental_id = r.rental_id)
join inventory i on (r.inventory_id = i.inventory_id)
join film f on (i.film_id = f.film_id)
group by 1 
order by 2 desc
limit 10;

* postgresql://manny:***@127.0.0.1:5433/dvdrental
10 rows affected.

[('Telegraph Voyage', Decimal('215.75')),
 ('Zorro Ark', Decimal('199.72')),
 ('Wife Turn', Decimal('198.73')),
 ('Innocent Usual', Decimal('191.74')),
 ('Hustler Party', Decimal('190.78')),
 ('Saturday Lambs', Decimal('190.74')),
 ('Titans Jerk', Decimal('186.73')),
 ('Harry Idaho', Decimal('177.73')),
 ('Torque Bound', Decimal('169.76')),
 ('Dogma Family', Decimal('168.72'))]